[
  {
    "name": "Solomon Ssekiranda",
    "role": "Cofounder",
    "bio": "Solomon is a passionate advocate for education and healthcare, holding a Bachelor's degree in Education (Chemistry and Mathematics) from Makerere University. Currently pursuing a Bachelor's in Medicine and Surgery at Kabale University, he has served as Vice President and Director of Research and Projects in the Federation of Uganda Medical Students' Association (FUMSA).",
    "image": "./assets/images/team/solomon.png"
  },
  {
    "name": "Robinson Byamukama",
    "role": "Cofounder",
    "bio": "Robinson is a dedicated medical student at Kabale University. He has held several leadership roles in the Federation of Uganda Medical Students' Association (FUMSA), including President and Director of Community Health, where he spearheaded health awareness campaigns and fostered collaboration among students to address healthcare disparities.",
    "image": "./assets/images/team/robinson.jpg"
  },
  {
    "name": "Stanley Okecho",
    "role": "Secretary General",
    "bio": "Stanley brings exceptional organizational skills and a commitment to transparency. With a background in community development and leadership training, he is well-positioned in seamless communication and coordination across all our initiatives.",
    "image": "./assets/images/team/stanley.jpg"
  },
  {
    "name": "Judith Nahwera",
    "role": "Program Manager",
    "bio": "Judith is a dedicated community development specialist with extensive experience in grassroots organizing. Her passion for empowering local communities and building sustainable relationships has been instrumental in expanding our reach and ensuring our programs effectively address the needs of the communities we serve.",
    "image": "./assets/images/team/judith.jpg"
  },
  {
    "name": "Farouk Jjingo",
    "role": "Innovations Manager",
    "bio": "Farouk is a visionary leader dedicated to rural empowerment through innovation and sustainable social entrepreneurship. He has a Bachelor's in Medicine and Surgery from Mbarara University and has founded CareWave+ and EcoSpin. He is currently developing an inclusive telemedicine platform and recycling initiatives that will benefit millions of Ugandans. His expertise in digital health and project management drives Touched Hearts' innovative solutions.",
    "image": "./assets/images/team/farouk.png"
  }
]
