[
    {
        "title": "A New Hope for Nalem Judith",
        "image": "./assets/images/judith.jpg",
        "quote": "If it were not for Touched Hearts, I would never have known what was wrong with me. They saved my life by organizing this camp, diagnosing me, and ensuring I got the right treatment. They even supported me financially so that I can manage my basic needs as I undergo treatment. May God bless them abundantly for their kindness and love for the people of Moroto.",
        "story": "Nalem Judith, a resident of Nakapirimen in Moroto District, had been unwell for months, suffering from persistent abdominal pain, unexplained weight loss, and general body weakness. With limited access to proper healthcare, she had resigned herself to enduring the pain, unaware of the severity of her condition. But hope arrived when Touched Hearts organized a medical camp in Moroto Municipality. Hearing about the free screenings and treatment, Nalem made her way to the camp, desperate for relief. She was warmly received and examined by a doctor who ordered several tests, including an ultrasound, GeneXpert, Liver Function Tests (LFTs), and Renal Function Tests (RFTs). The diagnosis was staggering: abdominal tuberculosis (TB) had spread to her liver and kidneys. Though overwhelmed, Nalem felt relieved to finally understand her suffering. Touched Hearts went beyond diagnosis—they arranged for her transfer to a hospital in Moroto for further evaluation and later admission to Moroto Regional Referral Hospital for extended treatment. They also provided financial assistance to cover her daily needs. With tears of gratitude, Nalem now has a fighting chance at recovery, thanks to Touched Hearts’ unwavering support."
    },
    {
        "title": "Bringing Joy to Biraara Village",
        "image": "./assets/images/biraara.jpg",
        "quote": "This is a blessing. Many of our children come to school eager to learn, but they lack the necessary materials. Today, you have given them more than just books and pens—you have given them hope.",
        "story": "It was a bright Friday morning in Biraara Village, Kisoro District, when Rising Hope Model School buzzed with excitement. The children, mostly from the vulnerable Batwa community, gathered with wide eyes and eager hearts. Their school compound, typically a place of learning and play, became a stage for an extraordinary act of kindness. Robinson Byamukama and Solomon Ssekiranda, passionate advocates working with Touched Hearts and supported by the Indo-Africa Charitable Society, arrived with smiles and a mission: to deliver scholastic materials to 349 children who often lacked basic supplies. As books, pens, and pencils were handed out, the children’s faces lit up with joy. Tiny hands clutched their new treasures—some holding their very first personal books after years of sharing worn-out copies. Laughter and chatter filled the air, spreading contagious happiness. Headteacher Mr. Kamugisha expressed his gratitude, saying the donation was a blessing that empowered eager learners. Teacher Ms. Nankunda added that every child could now fully participate in class without feeling left out. As Robinson and Solomon departed, they left behind a legacy of hope, proving that small gifts can create immense impact in Biraara Village."
    },
    {
        "title": "A Wheelchair, A New Beginning",
        "image": "./assets/images/eminati.jpg",
        "quote": "This wheelchair is more than just a means of movement; it is a key to a new life. Now, I can move around freely, seek opportunities, and even work towards a future where I don’t have to beg to survive. It has given me back my dignity, my independence, and my hope.",
        "story": "During a Touched Hearts medical camp in Karamoja, team leaders Ssekiranda Solomon and Robinson heard about a disabled man who sat outside a supermarket daily, begging to survive. With no means of movement, he relied entirely on the kindness of passersby. Moved by his plight, the team visited him and witnessed his profound struggle firsthand. Determined to act, they partnered with the Indo Africa Charitable Organisation through Touched Hearts to provide him with a wheelchair. His name was Eminati Robert, and for years, his disability had trapped him in helplessness amidst Karamoja’s harsh realities. When the wheelchair was presented, his joy was palpable—a dream come true. For the first time in years, he felt seen and valued. The gift restored his mobility, dignity, and independence, opening doors to new opportunities. Eminati expressed heartfelt thanks, urging continued support for others like him in Karamoja. This single act reinforced Touched Hearts’ commitment to ensuring no one is left behind, turning Eminati’s daily struggle into a story of hope and renewal."
    },
    {
        "title": "Dignity in Every Pad",
        "image": "./assets/images/sanitary_pads.jpg",
        "quote": "I used to miss school every month because I couldn’t afford pads. Now, thanks to Touched Hearts, I can stay in class and focus on my dreams. It’s more than just pads—it’s my future.",
        "story": "In the rural classrooms of Nakaseke District, 15-year-old Amina faced a quiet struggle every month. Like many girls her age, she couldn’t afford sanitary pads, forcing her to miss school during her periods. The shame and inconvenience kept her from her studies, threatening her dream of becoming a nurse. That changed when Touched Hearts arrived at her school with a mission to support girls’ education. On a warm afternoon, the team distributed sanitary pads to over 200 students, along with lessons on menstrual health. Amina’s eyes sparkled as she received her pack—she wouldn’t have to skip class anymore. Teachers noticed a difference too; attendance soared, and girls like Amina gained confidence. With this simple yet profound gift, Touched Hearts ensured that menstruation wouldn’t stand between these girls and their education, proving that dignity starts with the basics."
    },
    {
        "title": "Nets of Protection",
        "image": "./assets/images/mosquito_nets.jpg",
        "quote": "We used to live in fear of malaria every night. Now, with these nets, my children sleep soundly, and I feel like we’ve been given a shield. Thank you, Touched Hearts, for caring about us.",
        "story": "In the swampy outskirts of Jinja, nights were a battleground for Esther and her four children. Mosquitoes buzzed relentlessly, bringing malaria that struck her family time and again. Hospital visits drained their meager savings, and Esther worried constantly about her little ones. Then, Touched Hearts stepped in. On a sunny Saturday, volunteers arrived in her village, distributing mosquito nets to 150 families. Esther watched as her kids giggled, helping to hang the net over their sleeping mats. That night, for the first time in months, they slept without bites. Weeks later, she shared how the fevers had stopped, and her children’s energy had returned. The nets didn’t just protect their bodies—they restored peace to her home. Touched Hearts turned a small act into a lifeline, showing Esther’s family they weren’t forgotten."
    },
    {
        "title": "Voices of Strength",
        "image": "./assets/images/counseling_girls.jpg",
        "quote": "I almost dropped out because I thought I wasn’t good enough. But the counseling from Touched Hearts made me believe in myself again. Now, I’m staying in school to become a teacher.",
        "story": "Sarah, a shy 16-year-old from Lira, sat in her secondary school classroom, feeling lost. Pressure from home and doubts about her abilities pushed her close to dropping out. She wasn’t alone—many girls in her school faced similar struggles. Touched Hearts recognized this and organized a counseling program for over 100 secondary school girls. On the day of the session, Sarah joined a circle of peers as counselors shared stories of resilience and offered one-on-one support. They talked about self-worth, goal-setting, and overcoming obstacles. Sarah left with a notebook full of encouragement and a renewed spark. Months later, her grades improved, and she began tutoring younger students. Touched Hearts didn’t just keep her in school—they gave her a voice and a vision for a future where she’d lift others up too."
    },
    {
        "title": "A Roof of Resilience",
        "image": "./assets/images/new_roof.jpg",
        "quote": "Rain used to pour through our roof, soaking everything. Now, with a new roof from Touched Hearts, my family has a dry home—and I have hope for a better tomorrow.",
        "story": "For years, Mama Joy and her three children huddled under a leaking roof in their mud-brick home in Gulu. Every rainy season brought misery—wet clothes, ruined food, and sleepless nights. The cost of repairs was far beyond their reach. Then, Touched Hearts launched a community support project, identifying families like hers in desperate need. Volunteers arrived with materials and hands ready to help. In just two days, Mama Joy’s home had a sturdy new roof. Her kids danced as the first raindrops fell outside, not inside. She smiled, saying it was the first time she felt secure in years. Beyond shelter, Touched Hearts gave her family stability and a chance to focus on thriving, not just surviving."
    },
    {
        "title": "Seeds of Tomorrow",
        "image": "./assets/images/farming_seeds.jpg",
        "quote": "With these seeds, I can grow food for my family and sell the extra. Touched Hearts didn’t just give us seeds—they gave us a way to stand on our own.",
        "story": "Peter, a father of five in Arua, watched his crops fail season after season due to poor-quality seeds and drought. Hunger crept closer, and he felt helpless. That’s when Touched Hearts arrived with a farming initiative, distributing high-quality seeds and training to 80 local families. Peter received maize and bean seeds, along with tips on sustainable planting. As the rains came, his fields turned green. Months later, he harvested enough to feed his family and sell at the market. His kids started eating better, and he saved for their school fees. Peter’s gratitude shone as he thanked Touched Hearts for planting not just seeds, but a future his family could build on."
    },
    
        {
            "title": "A Vision Restored",
            "image": "./assets/images/eye_camp.jpg",
            "quote": "I thought I’d never see my grandchildren’s faces clearly again. Touched Hearts brought light back into my life with this surgery.",
            "story": "In the dusty village of Kotido, 62-year-old Agnes had lived with blurry vision for years. Cataracts had stolen her sight, leaving her dependent on her family. When Touched Hearts announced a free eye camp, her son carried her to the site. The team of doctors examined her and scheduled a simple surgery. Within hours, the bandages came off, and Agnes saw the world in sharp colors again. She wept as she looked at her grandson’s smile for the first time in years. Touched Hearts didn’t just restore her vision—they gave her back her independence and joy, proving healthcare can transform lives in the remotest corners."
        },
        {
            "title": "Learning Without Limits",
            "image": "./assets/images/school_tables.jpg",
            "quote": "We used to sit on the floor, but now we have desks and chairs. It feels like someone believes in our dreams.",
            "story": "In a small school in Amuria District, 120 students squeezed onto the dirt floor each day, straining to write without desks. Touched Hearts learned of their plight and arrived with a truckload of tables and chairs. The children cheered as volunteers assembled the furniture, turning their cramped classroom into a proper learning space. Nine-year-old Grace beamed as she sat at her own desk for the first time, her pencil steady on a smooth surface. Teachers reported better focus and pride among the students. Touched Hearts showed that education thrives when the basics are met."
        },
        {
            "title": "Steps to Freedom",
            "image": "./assets/images/crutch_delivery.jpg",
            "quote": "These crutches mean I can go to the market and see my friends again. Touched Hearts gave me my legs back.",
            "story": "After a motorcycle accident in Soroti, 28-year-old James lost the use of his left leg. Confined to his hut, he watched life pass by, unable to work or socialize. Touched Hearts heard his story during a community outreach and delivered a sturdy pair of crutches. James took his first steps outside in months, grinning as neighbors waved. With mobility restored, he began selling vegetables at the market, rebuilding his life. Touched Hearts’ small gift became a bridge to independence, showing disability support can spark new beginnings."
        },
        {
            "title": "Water for Wellness",
            "image": "./assets/images/clean_water.jpg",
            "quote": "We used to get sick from the river water. Now, with this borehole, my kids are healthy, and I have peace.",
            "story": "In Bukedea Village, fetching water meant hours of walking to a muddy river for Mama Sarah and her six children. Frequent stomachaches plagued the family, draining their energy and resources. Touched Hearts partnered with local leaders to drill a borehole right in the village center. The day clean water flowed, children danced around the pump. Sarah noticed fewer illnesses and brighter smiles at home. By tackling a root cause of poor health, Touched Hearts turned a simple well into a cornerstone of community strength."
        },
        {
            "title": "Books Open Doors",
            "image": "./assets/images/library_donation.jpg",
            "quote": "I want to be a doctor, and these books make me feel closer to that dream. Thank you, Touched Hearts.",
            "story": "At a rural school in Mbale, 14-year-old Isaac dreamed of studying medicine, but the library was just a shelf of tattered books. Touched Hearts arrived with a donation of 500 textbooks—science, math, and literature—transforming a dusty room into a vibrant resource hub. Isaac spent hours poring over biology pages, his ambition fueled by every word. Teachers noted a surge in curiosity among students. With this gift, Touched Hearts opened a world of knowledge, paving the way for future leaders."
        },
        {
            "title": "A Voice for the Silent",
            "image": "./assets/images/hearing_aid.jpg",
            "quote": "I heard my mother’s voice for the first time today. This hearing aid changed everything for me.",
            "story": "Eleven-year-old Lydia from Tororo was born deaf, isolated from conversations and school lessons. During a Touched Hearts disability camp, audiologists fitted her with a hearing aid. As it clicked on, Lydia’s eyes widened—she giggled at the sound of birds, then cried hearing her mother say her name. With follow-up support, she began learning spoken words, catching up with peers. Touched Hearts didn’t just give her a device—they gave her a chance to connect, proving disability support can break barriers."
        },
        {
            "title": "Healing Hands in Apac",
            "image": "./assets/images/mobile_clinic.jpg",
            "quote": "The clinic came to us when we couldn’t reach it. Touched Hearts saved my baby’s life.",
            "story": "In Apac District, 22-year-old Ruth cradled her feverish infant, miles from the nearest health center. A Touched Hearts mobile clinic rolled into her village just in time, equipped with nurses and medicine. They diagnosed malaria and started treatment immediately. Ruth watched her baby’s breathing steady, relief washing over her. The clinic served 200 others that day, from vaccinations to check-ups. By bringing healthcare to the doorstep, Touched Hearts turned desperation into gratitude."
        },
        {
            "title": "Chalk and Courage",
            "image": "./assets/images/teacher_training.jpg",
            "quote": "I used to struggle to teach, but now I have the skills to inspire my students. Touched Hearts lifted us all.",
            "story": "In a struggling school in Kasese, Teacher Jane faced overcrowded classes with little training. Touched Hearts launched a workshop for 50 rural educators, teaching modern methods and classroom management. Jane returned with lesson plans and confidence, engaging her 60 students like never before. Test scores rose, and parents noticed happier kids. By empowering teachers, Touched Hearts built a ripple effect of education that reached every child in the room."
        },
        {
            "title": "Wheels of Opportunity",
            "image": "./assets/images/bicycle_donation.jpg",
            "quote": "This bicycle means I can get to school and help my family. It’s a gift of time and freedom.",
            "story": "Thirteen-year-old Musa from Nebbi walked two hours each way to school, arriving tired and late. Touched Hearts identified students like him and donated 50 bicycles to ease their journeys. Musa pedaled to class in minutes, with energy to learn and time to help his parents farm. His grades climbed, and he dreamed of becoming an engineer. A simple bike from Touched Hearts became a vehicle for education and ambition."
        },
        {
            "title": "Stitches of Care",
            "image": "./assets/images/surgery_camp.jpg",
            "quote": "I lived with pain for years because I couldn’t afford surgery. Touched Hearts took that burden away.",
            "story": "Forty-year-old David from Iganga suffered from a hernia that made work agonizing. With no money for an operation, he endured in silence. Touched Hearts’ surgical camp arrived, offering free procedures to 75 patients. David’s surgery was a success—he walked home pain-free, ready to farm again. His family celebrated his recovery, thanking the team that stitched hope back into their lives. Healthcare became a reality, not a dream, thanks to Touched Hearts."
        },
        {
            "title": "A Classroom Reborn",
            "image": "./assets/images/school_renovation.jpg",
            "quote": "Our school was falling apart, but now it’s a place we’re proud of. Touched Hearts gave us more than walls—they gave us a future.",
            "story": "In Pader District, a crumbling school housed 200 students under a roof that leaked and walls that cracked. Touched Hearts rallied volunteers to renovate it—new bricks, windows, and a fresh coat of paint. The children returned to a bright, safe space, their chatter echoing off sturdy walls. Attendance jumped, and teachers felt renewed pride. Touched Hearts turned a dilapidated building into a foundation for learning and community."
        },
        {
            "title": "Legs to Stand On",
            "image": "./assets/images/prosthetic_leg.jpg",
            "quote": "I thought I’d never walk again, but this leg from Touched Hearts gave me back my life.",
            "story": "After losing her leg in a landmine accident in Agago, 19-year-old Florence felt her dreams slip away. Touched Hearts partnered with a prosthetics team to fit her with an artificial limb. She practiced daily, her first steps shaky but triumphant. Soon, she walked to the market, head high. Florence now plans to train as a tailor, her confidence restored. Touched Hearts showed that disability support can rebuild both bodies and spirits."
        },
        {
            "title": "Breath of Life",
            "image": "./assets/images/asthma_care.jpg",
            "quote": "I couldn’t breathe without fear. Now, with this inhaler, I can play with my friends again.",
            "story": "Eight-year-old Kevin from Busia gasped through asthma attacks, his parents unable to afford consistent treatment. At a Touched Hearts health camp, doctors diagnosed him and provided an inhaler with a year’s supply of refills. Kevin’s wheezing faded, and he ran with classmates for the first time. His mother cried, grateful for a solution that fit their budget. Touched Hearts turned a chronic struggle into a manageable hope."
        },
        {
            "title": "Roots of Unity",
            "image": "./assets/images/tree_planting.jpg",
            "quote": "These trees will shade our children and clean our air. Touched Hearts planted a future for us all.",
            "story": "In the heat of Yumbe, deforestation left the land bare and the air thick. Touched Hearts mobilized 300 villagers for a tree-planting day, distributing 1,000 saplings. Young and old dug together, laughing as they rooted mango and acacia trees. Over months, green patches emerged, cooling homes and sparking pride. The community bonded over the effort, and Touched Hearts showed that collective work can heal both land and spirits."
        },
        {
            "title": "Light in the Darkness",
            "image": "./assets/images/solar_lamps.jpg",
            "quote": "I can study at night now, and my parents don’t worry about kerosene. This lamp is my ticket to college.",
            "story": "In off-grid Lamwo, 16-year-old Esther strained to read by dim kerosene light, her eyes burning and grades slipping. Touched Hearts distributed solar lamps to 100 households, illuminating her evenings. She studied late, acing her exams and aiming for university. Her parents saved money and breathed easier without fumes. A small light from Touched Hearts brightened Esther’s path to a bigger future."
        },
        
          {
                "title": "A Heartbeat Heard",
                "image": "./assets/images/prenatal_care.jpg",
                "quote": "I didn’t know if my baby was okay until Touched Hearts brought the ultrasound. Now I feel ready to be a mother.",
                "story": "In the remote hills of Kabale, 24-year-old Lillian carried her first child with no access to prenatal care. Fear gnawed at her—miscarriages were common in her village. Touched Hearts arrived with a portable ultrasound machine, screening 50 expectant mothers. Lillian heard her baby’s heartbeat for the first time, tears streaming as a nurse explained everything was fine. With vitamins and check-up schedules, Touched Hearts eased her worries, ensuring a healthier start for mother and child."
            },
            {
                "title": "Pages of Promise",
                "image": "./assets/images/storybooks.jpg",
                "quote": "These storybooks make reading fun. Now I want to write my own stories one day.",
                "story": "In a quiet school in Luwero, 10-year-old Mercy struggled with reading, bored by outdated texts. Touched Hearts donated 300 colorful storybooks to her school, sparking a love for words. Mercy clutched a tale about a brave girl, reading late into the night by candlelight. Her teacher noticed her vocabulary soar, and soon she was crafting short tales for classmates. Touched Hearts turned literacy into an adventure, opening doors to creativity."
            },
            {
                "title": "Hands That Build",
                "image": "./assets/images/wheelchair_ramp.jpg",
                "quote": "I can roll into church now without help. This ramp gave me back my community.",
                "story": "In Adjumani, 35-year-old Patrick, a wheelchair user, missed Sunday services because the church steps barred his way. Touched Hearts collaborated with locals to build ramps at key buildings—church, market, and clinic. Patrick wheeled in proudly, greeted by friends he hadn’t seen in months. The ramps didn’t just ease access; they wove him back into village life. Touched Hearts showed that disability support can bridge gaps."
            },
            {
                "title": "Farming for Health",
                "image": "./assets/images/nutrition_garden.jpg",
                "quote": "These vegetables keep my kids strong. Touched Hearts taught us how to grow our own medicine.",
                "story": "In Katakwi, malnutrition weakened Mama Alice’s three children, their small frames prone to illness. Touched Hearts introduced a nutrition program, teaching 60 families to plant vegetable gardens. Alice tended spinach and carrots, her kids growing taller and livelier with every harvest. Nurses noted fewer clinic visits. By blending agriculture and healthcare, Touched Hearts sowed resilience in a hungry community."
            },
            {
                "title": "Blackboards of Belief",
                "image": "./assets/images/classroom_supplies.jpg",
                "quote": "With a new blackboard, I can see the lessons clearly. It’s like Touched Hearts gave us a bigger world.",
                "story": "At a school in Oyam, 150 students squinted at a cracked, faded blackboard, missing half the lessons. Touched Hearts delivered new boards, chalk, and erasers, transforming dim classrooms. Twelve-year-old Simon traced math problems with ease, his confidence rising with every solved equation. Teachers smiled as engagement spiked. A simple fix from Touched Hearts sharpened young minds for a brighter future."
            },
            {
                "title": "Eyes on the Prize",
                "image": "./assets/images/glasses_donation.jpg",
                "quote": "I couldn’t read the board before. These glasses from Touched Hearts made school fun again.",
                "story": "Fourteen-year-old Rose from Masindi sat at the back of class, her blurry vision hiding the teacher’s notes. During a Touched Hearts vision camp, optometrists tested 200 students and gave Rose her first pair of glasses. She marveled at crisp letters, her grades climbing as she joined debates. Touched Hearts turned a small lens into a big opportunity, keeping her in the race for education."
            },
            {
                "title": "A Safe Delivery",
                "image": "./assets/images/maternity_kit.jpg",
                "quote": "I gave birth safely because of this kit. Touched Hearts made me feel cared for.",
                "story": "In Kole District, 19-year-old Esther faced childbirth alone, with no supplies or clinic nearby. Touched Hearts distributed maternity kits—gloves, blankets, and sterile tools—to 80 expectant mothers. When labor came, a trained midwife used Esther’s kit, delivering a healthy boy. Esther named him Hope, grateful for the support that saved them both. Touched Hearts ensured motherhood began with safety."
            },
            {
                "title": "The Power of Play",
                "image": "./assets/images/sports_equipment.jpg",
                "quote": "This ball lets us run and laugh together. Touched Hearts brought joy back to our school.",
                "story": "In Bundibugyo, 200 children at a rural school kicked stones for fun, lacking proper playthings. Touched Hearts arrived with soccer balls, nets, and jump ropes. Eleven-year-old David scored his first goal, his shy grin lighting up the field. Teachers saw teamwork and energy soar. By fostering play, Touched Hearts built healthier bodies and happier hearts."
            },
            {
                "title": "Steps of Strength",
                "image": "./assets/images/physiotherapy.jpg",
                "quote": "I couldn’t stand after the accident, but Touched Hearts helped me walk again.",
                "story": "After a fall in Rukungiri, 40-year-old Beatrice lay bedridden, her legs weak from injury. Touched Hearts brought a physiotherapy team to her village, guiding 30 patients through exercises. Beatrice gripped a walker, taking slow steps as her strength returned. Weeks later, she fetched water herself, pride in her stride. Touched Hearts turned recovery into triumph for those once sidelined."
            },
            {
                "title": "Wells of Wisdom",
                "image": "./assets/images/water_tank.jpg",
                "quote": "This tank means I don’t miss school to fetch water. Now I can study and dream.",
                "story": "In Kumi, 13-year-old Janet spent mornings hauling water, arriving late and tired to class. Touched Hearts installed a rainwater tank at her school, serving 250 students. Janet stayed in lessons, her hands free of buckets and her mind on books. Attendance rose, and girls like her thrived. Touched Hearts proved clean water fuels education."
            },
            {
                "title": "A Cure in Reach",
                "image": "./assets/images/medicine_drive.jpg",
                "quote": "I couldn’t afford the pills, but Touched Hearts brought them to me. Now I’m getting better.",
                "story": "In Nwoya, 55-year-old Joseph battled hypertension, his savings gone and clinic far. Touched Hearts held a medicine drive, supplying free drugs to 150 patients. Joseph swallowed his first dose, his headaches fading over weeks. He tended his garden again, thanking the team that bridged the gap. Healthcare from Touched Hearts became a lifeline for the forgotten."
            },
            {
                "title": "Threads of Skill",
                "image": "./assets/images/sewing_machine.jpg",
                "quote": "This machine lets me earn a living. Touched Hearts gave me a way to stand tall.",
                "story": "In Kamuli, 30-year-old Fatuma, a single mother with a limp, struggled to feed her kids. Touched Hearts donated sewing machines to 20 disabled women, training them in tailoring. Fatuma stitched dresses, her first sale lighting up her face. She saved for school fees, her disability no longer a limit. Touched Hearts wove independence into every thread."
            },
            {
                "title": "Songs of Solidarity",
                "image": "./assets/images/music_program.jpg",
                "quote": "Singing with my friends makes me feel strong. Touched Hearts gave us a voice.",
                "story": "In Pakwach, 50 teens gathered weekly, their spirits low after floods displaced them. Touched Hearts launched a music program, supplying drums and a teacher. Sixteen-year-old Bosco beat rhythms, his grief easing in song. The group performed at a festival, earning cheers and unity. Touched Hearts turned notes into healing for a wounded community."
            },
            {
                "title": "Feet on the Path",
                "image": "./assets/images/school_shoes.jpg",
                "quote": "These shoes mean I can walk to school without pain. Touched Hearts kept me going.",
                "story": "In Zombo, 11-year-old Amina trekked barefoot to school, her soles blistered. Touched Hearts gave sturdy shoes to 300 students, fitting Amina’s feet perfectly. She skipped along the path, arriving fresh for lessons. Her parents saw her focus sharpen. A pair of shoes from Touched Hearts stepped her closer to her dreams."
            },
            {
                "title": "Breathing Easy",
                "image": "./assets/images/tb_screening.jpg",
                "quote": "I coughed for months, but Touched Hearts found the problem and helped me heal.",
                "story": "In Amolatar, 38-year-old Peter hid his worsening cough, fearing tuberculosis but unable to pay for tests. Touched Hearts set up a TB screening camp, testing 200 people. Peter’s diagnosis came fast, and treatment started free. Months later, his lungs cleared, and he hugged his kids without worry. Touched Hearts snuffed out a silent killer."
            },
            {
                "title": "Fields of Learning",
                "image": "./assets/images/agri_training.jpg",
                "quote": "I learned to farm better and feed my family. Touched Hearts grew my hope.",
                "story": "In Otuke, 45-year-old Moses scratched a living from dry soil, his yields shrinking. Touched Hearts trained 70 farmers in crop rotation and irrigation. Moses planted millet with new methods, his harvest doubling. He sold surplus, buying schoolbooks for his son. Touched Hearts cultivated knowledge that fed both body and future."
            },
            {
                "title": "Wheels for Work",
                "image": "./assets/images/tricycle_donation.jpg",
                "quote": "This tricycle lets me sell my goods. Touched Hearts turned my disability into strength.",
                "story": "In Hoima, 27-year-old Isaac, paralyzed from the waist down, begged by the roadside. Touched Hearts gave him a hand-powered tricycle, perfect for mobility. He pedaled to market, selling maize and earning steady cash. His family ate better, and he smiled wider. Touched Hearts rolled opportunity into his life."
            },
            {
                "title": "A Shot at Health",
                "image": "./assets/images/vaccination_drive.jpg",
                "quote": "My baby won’t get sick like I did. Touched Hearts brought the needles that protect us.",
                "story": "In Budaka, 23-year-old Miriam queued with her infant at a Touched Hearts vaccination drive, immunizing 400 kids against measles and polio. Her son giggled through the shot, safe from diseases that scarred her childhood. Nurses taught her about follow-ups. Touched Hearts built a shield for the next generation."
            },
            {
                "title": "Walls of Welcome",
                "image": "./assets/images/community_hall.jpg",
                "quote": "This hall is ours now—meetings, weddings, everything. Touched Hearts gave us a home.",
                "story": "In Isingiro, villagers met under trees, rain or shine, with no gathering space. Touched Hearts built a community hall, brick by brick, for 500 residents. The first event—a youth dance—filled it with laughter. Leaders planned projects inside, unity growing. Touched Hearts raised a roof for connection."
            },
            {
                "title": "Eyes That Teach",
                "image": "./assets/images/teacher_glasses.jpg",
                "quote": "I can read my notes again and teach better. Touched Hearts sharpened my sight.",
                "story": "In Moyo, 50-year-old Teacher Agnes strained through cloudy vision, her lessons faltering. Touched Hearts’ eye camp fitted her with glasses, serving 60 educators. She chalked equations clearly, her students thriving. A pair of lenses from Touched Hearts kept knowledge flowing."
            },
            {
                "title": "Hands of Healing",
                "image": "./assets/images/wound_care.jpg",
                "quote": "My leg wouldn’t heal until Touched Hearts came. Now I can work again.",
                "story": "In Dokolo, 33-year-old Grace limped on an infected foot, untreated for weeks. Touched Hearts’ wound care team cleaned and bandaged 90 patients, including her. Grace’s swelling faded, and she hoed her garden again. Simple care from Touched Hearts restored her livelihood."
            },
            {
                "title": "Keys to Knowledge",
                "image": "./assets/images/computer_lab.jpg",
                "quote": "I touched a computer for the first time. Touched Hearts opened a new world for me.",
                "story": "In Wakiso, 15-year-old Brian dreamed of tech but had no access. Touched Hearts set up a computer lab with 10 machines for his school. Brian typed his first email, eyes wide at the screen. His coding skills grew, aiming for a career. Touched Hearts plugged him into the future."
            },
            {
                "title": "Arms of Comfort",
                "image": "./assets/images/prosthetic_arm.jpg",
                "quote": "I can hold my daughter now. This arm from Touched Hearts made me whole again.",
                "story": "In Kitgum, 29-year-old Paul lost his arm in a fire, feeling useless at home. Touched Hearts fitted him with a prosthetic limb after months of therapy. He scooped up his girl, laughing through tears. Work became possible again. Touched Hearts rebuilt more than his body."
            },
            {
                "title": "Fires of Safety",
                "image": "./assets/images/stove_donation.jpg",
                "quote": "This stove cooks fast and keeps smoke out. Touched Hearts warmed our home.",
                "story": "In Koboko, Mama Ruth coughed over an open fire, her kids’ eyes red from smoke. Touched Hearts gave 50 families fuel-efficient stoves. Ruth boiled millet easily, her lungs clearer. Health improved, and wood lasted longer. Touched Hearts sparked safer days."
            },
            {
                "title": "Wings of Words",
                "image": "./assets/images/radio_education.jpg",
                "quote": "I learn from the radio now, even far from school. Touched Hearts brought lessons to me.",
                "story": "In Kaabong, 12-year-old Esther missed class during rains, her village isolated. Touched Hearts distributed radios with educational broadcasts to 200 homes. Esther tuned in, reciting math drills. Her mind stayed sharp despite distance. Touched Hearts flew knowledge to the unreachable."
            },
            {
                "title": "Steps to Safety",
                "image": "./assets/images/road_signs.jpg",
                "quote": "These signs stop accidents. Touched Hearts made our paths safer.",
                "story": "In Kapchorwa, crashes plagued a busy road, kids at risk. Touched Hearts installed signs and speed bumps, teaching 300 residents safety rules. Twelve-year-old Joel crossed confidently, no longer dodging bikes. Injuries dropped, and peace settled. Touched Hearts paved protection."
            },
            {
                "title": "Hands That Feed",
                "image": "./assets/images/goat_project.jpg",
                "quote": "This goat gives us milk and money. Touched Hearts lifted us up.",
                "story": "In Moroto, 40-year-old Esther’s family ate once daily, hunger constant. Touched Hearts gave 50 goats to vulnerable households, training them in care. Esther’s goat birthed twins, milk flowing and kids sold. Her table filled, gratitude deep. Touched Hearts bred sustenance."
            },
            {
                "title": "Eyes of Courage",
                "image": "./assets/images/blind_cane.jpg",
                "quote": "This cane guides me everywhere. Touched Hearts showed me I’m not alone.",
                "story": "In Lira, 60-year-old blind John stayed indoors, fearing falls. Touched Hearts gave white canes and mobility lessons to 40 visually impaired people. John tapped his way to market, chatting with vendors. Independence returned, and he felt seen. Touched Hearts lit his path."
            },
            {
                "title": "Beats of Life",
                "image": "./assets/images/heart_checkup.jpg",
                "quote": "I didn’t know my heart was weak until Touched Hearts checked it. Now I’m stronger.",
                "story": "In Gulu, 47-year-old David tired easily, brushing it off. Touched Hearts’ heart health camp screened 150 adults, finding his arrhythmia. Meds and advice followed, his energy rebounding. He danced at a wedding, thanking the team. Touched Hearts kept his pulse steady."
            },
            {
                "title": "Roofs of Refuge",
                "image": "./assets/images/shelter_repair.jpg",
                "quote": "Storms don’t scare us anymore. Touched Hearts fixed our home.",
                "story": "In Abim, Mama Lydia’s hut collapsed in a gale, her five kids exposed. Touched Hearts rebuilt 30 homes with iron sheets and nails. Lydia’s family slept dry, fear gone. Stability returned, and they thrived. Touched Hearts sheltered their spirits."
            },
            {
                "title": "Lines of Learning",
                "image": "./assets/images/adult_literacy.jpg",
                "quote": "I can write my name now. Touched Hearts gave me a second chance.",
                "story": "In Nakapiripirit, 35-year-old Mary never attended school, illiterate and shy. Touched Hearts started an adult literacy class for 50 women. Mary traced letters, signing her name proudly. She read shop signs, confidence blooming. Touched Hearts wrote her into the world."
            },
            {
                "title": "Wheels of Joy",
                "image": "./assets/images/kids_wheelchair.jpg",
                "quote": "I can race my friends now. Touched Hearts made me feel like a kid again.",
                "story": "In Jinja, 9-year-old Sam, wheelchair-bound, watched playtime from afar. Touched Hearts gave him a lightweight chair built for fun. He zoomed across the yard, laughing with pals. Inclusion replaced isolation. Touched Hearts spun happiness into his days."
            },
            {
                "title": "Drops of Dignity",
                "image": "./assets/images/water_filters.jpg",
                "quote": "This filter keeps us healthy. Touched Hearts cleaned our lives.",
                "story": "In Bugiri, Mama Jane’s family drank murky water, sickness routine. Touched Hearts gave 100 households water filters. Jane poured clear cups, her kids’ fevers rare now. Time once spent boiling was hers again. Touched Hearts purified more than water."
            },
            {
                "title": "Notes of Hope",
                "image": "./assets/images/music_therapy.jpg",
                "quote": "Playing this drum heals my heart. Touched Hearts helped me smile again.",
                "story": "In Arua, 17-year-old Grace withdrew after losing her parents. Touched Hearts brought music therapy to 60 teens, with drums and flutes. Grace tapped rhythms, her sadness lifting. She joined a band, finding family. Touched Hearts drummed joy back into her life."
            },
            {
                "title": "Steps to School",
                "image": "./assets/images/bridge_build.jpg",
                "quote": "This bridge means I don’t miss class in the rain. Touched Hearts crossed my fears.",
                "story": "In Kyegegwa, floods cut off 14-year-old Peter’s school route, days lost. Touched Hearts built a wooden bridge for 200 villagers. Peter walked dry-shod, his books safe. Attendance steadied, and he aimed higher. Touched Hearts spanned opportunity."
            },
            {
                "title": "Hands of Harvest",
                "image": "./assets/images/tool_donation.jpg",
                "quote": "These tools doubled my crop. Touched Hearts dug us out of hunger.",
                "story": "In Maracha, 50-year-old James hoed with a broken stick, yields slim. Touched Hearts gave 70 farmers hoes and machetes. James cleared land fast, his cassava thriving. His family ate well, surplus sold. Touched Hearts planted prosperity."
            },
            {
                "title": "A Voice Restored",
                "image": "./assets/images/speech_therapy.jpg",
                "quote": "I can talk to my sister now. Touched Hearts gave me words again.",
                "story": "In Soroti, 7-year-old Anna stammered after a fever, shunned by peers. Touched Hearts brought a speech therapist to 30 kids. Anna practiced sounds, her ‘hello’ clear at last. She chattered happily, friends returning. Touched Hearts spoke inclusion."
            },
            {
                "title": "Lights of Care",
                "image": "./assets/images/clinic_solar.jpg",
                "quote": "The clinic runs at night now. Touched Hearts lit up our health.",
                "story": "In Alebtong, a clinic closed at dusk, no power for emergencies. Touched Hearts installed solar panels, serving 500 patients. Nurse Betty delivered a baby by steady light, lives saved. Nighttime care became real. Touched Hearts powered healing."
            },
            {
                "title": "Fields of Friendship",
                "image": "./assets/images/coop_farming.jpg",
                "quote": "We farm together now and share the profits. Touched Hearts united us.",
                "story": "In Kibaale, 40 villagers worked alone, harvests small. Touched Hearts formed a co-op, pooling 50 plots and tools. Mama Rose reaped maize with neighbors, her income tripling. Bonds grew with every sack. Touched Hearts harvested community."
            },
            {
                "title": "Legs of Labor",
                "image": "./assets/images/leg_brace.jpg",
                "quote": "This brace lets me fetch water. Touched Hearts straightened my path.",
                "story": "In Napak, 25-year-old Susan dragged a twisted leg, chores agony. Touched Hearts fitted her with a brace after therapy. She stood tall, buckets balanced. Work resumed, and she felt useful. Touched Hearts braced her for life."
            },
            {
                "title": "Breath of Fresh Air",
                "image": "./assets/images/air_purifier.jpg",
                "quote": "My lungs feel clean now. Touched Hearts cleared the dust from my days.",
                "story": "In Kampala’s slums, 60-year-old Ruth wheezed in dusty air, asthma worsening. Touched Hearts gave air purifiers to 50 homes. Ruth breathed easier, sleeping through nights. Her cough softened, vitality back. Touched Hearts filtered her hope."
            },
            {
                "title": "Pens of Power",
                "image": "./assets/images/exam_kits.jpg",
                "quote": "This kit got me through my exams. Touched Hearts wrote my success.",
                "story": "In Mukono, 16-year-old David faced finals with no pens or calculator. Touched Hearts gave exam kits to 200 students. David solved math confidently, passing with honors. His college dream neared. Touched Hearts equipped his victory."
            },
            {
                "title": "Wheels of Trade",
                "image": "./assets/images/cart_donation.jpg",
                "quote": "This cart carries my fruits to market. Touched Hearts rolled me into business.",
                "story": "In Masaka, 45-year-old John, lame from polio, sold little, stuck at home. Touched Hearts gave him a hand-pushed cart. He wheeled mangoes to buyers, earnings soaring. His kids ate better, pride restored. Touched Hearts carted him to dignity."
            },
            {
                "title": "Seeds of Health",
                "image": "./assets/images/herb_garden.jpg",
                "quote": "These herbs cure my cough. Touched Hearts grew medicine for us.",
                "story": "In Bushenyi, 50-year-old Agnes relied on costly drugs for colds. Touched Hearts taught 60 families to grow medicinal herbs. Agnes brewed tea from her plot, symptoms fading. Clinic trips dropped, savings rose. Touched Hearts rooted wellness."
            },
            {
                "title": "Voices of Vision",
                "image": "./assets/images/leadership_training.jpg",
                "quote": "I lead my village now. Touched Hearts showed me I’m enough.",
                "story": "In Yumbe, 32-year-old Fatuma doubted her worth, voiceless in meetings. Touched Hearts trained 50 women in leadership. Fatuma spoke up, organizing a water project. Respect grew, and she stood tall. Touched Hearts amplified her strength."
            },
            {
                "title": "Steps of Pride",
                "image": "./assets/images/orthopedic_shoes.jpg",
                "quote": "These shoes fit my feet right. Touched Hearts walked me into confidence.",
                "story": "In Tororo, 15-year-old Bosco limped in ill-fitting shoes, his clubfoot aching. Touched Hearts gave orthopedic shoes to 40 kids. Bosco strode smoothly, joining football games. Pain eased, and he shone. Touched Hearts stepped him forward."
            },
            {
                "title": "Hearths of Harmony",
                "image": "./assets/images/cooking_training.jpg",
                "quote": "I cook for my neighbors now. Touched Hearts baked us into a family.",
                "story": "In Kisoro, 28-year-old Jane cooked alone, community distant. Touched Hearts held a cooking class for 50 women, sharing recipes. Jane hosted a meal, laughter filling her hut. Bonds tightened, isolation gone. Touched Hearts stirred unity."
            },
            {
                "title": "Eyes of Tomorrow",
                "image": "./assets/images/eye_drops.jpg",
                "quote": "My eyes don’t hurt anymore. Touched Hearts cleared my sight for school.",
                "story": "In Pallisa, 13-year-old Sarah rubbed itchy eyes, infections blurring her books. Touched Hearts gave eye drops and hygiene tips to 200 kids. Sarah’s vision cleared, her reading steady. She aimed for teaching. Touched Hearts focused her future."
            }
        ]